<a href="https://colab.research.google.com/github/banshita209/Data-Science-and-Machine-Learning-with-Python/blob/master/class9.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Handling missing value in pandas
* fillna
* replace
* interpolate

[data set link](https://drive.google.com/file/d/1VGCYD0qcmUVD5LcXF1ZLPyUlF5VwmRFX/view)

In [ ]:
import numpy as np
import pandas as pd

In [16]:
df=pd.read_csv("/content/student_data.csv")
df

   Id    CS  Math        Name
0   1  50.0  46.0     Average
1   2   NaN  70.0        Good
2   3  88.0   NaN  Execellent
3   4   NaN  74.0         NaN
4   5  63.0   NaN     Average
5   6   NaN   NaN  Execellent
6   7   NaN   NaN         NaN
7   8  53.0  45.0     Average
8   9  60.0  62.0        Good
9  10  55.0  65.0        Good

In [17]:
# fill all null value with zer0
df.fillna(0)

   Id    CS  Math        Name
0   1  50.0  46.0     Average
1   2   0.0  70.0        Good
2   3  88.0   0.0  Execellent
3   4   0.0  74.0           0
4   5  63.0   0.0     Average
5   6   0.0   0.0  Execellent
6   7   0.0   0.0           0
7   8  53.0  45.0     Average
8   9  60.0  62.0        Good
9  10  55.0  65.0        Good

In [18]:
#here value will according to mention dict
#for example : CS column will be filled with 0, Math will be filled with 0, and anem will be filled with no category
new_df=df.fillna({
    'CS':0,
    'Math':0,
    'Name':'No Catrgory'
})

new_df

   Id    CS  Math         Name
0   1  50.0  46.0      Average
1   2   0.0  70.0         Good
2   3  88.0   0.0   Execellent
3   4   0.0  74.0  No Catrgory
4   5  63.0   0.0      Average
5   6   0.0   0.0   Execellent
6   7   0.0   0.0  No Catrgory
7   8  53.0  45.0      Average
8   9  60.0  62.0         Good
9  10  55.0  65.0         Good

In [19]:
#fill according to pervious column or row
#ffill means forward fill
# all the null value will be replaced by the values in above row

new_df=df.fillna(method="ffill")
new_df

   Id    CS  Math        Name
0   1  50.0  46.0     Average
1   2  50.0  70.0        Good
2   3  88.0  70.0  Execellent
3   4  88.0  74.0  Execellent
4   5  63.0  74.0     Average
5   6  63.0  74.0  Execellent
6   7  63.0  74.0  Execellent
7   8  53.0  45.0     Average
8   9  60.0  62.0        Good
9  10  55.0  65.0        Good

In [20]:
# all the null value will be replaced by the values in below row
new_df=df.fillna(method="bfill")
new_df

   Id    CS  Math        Name
0   1  50.0  46.0     Average
1   2  88.0  70.0        Good
2   3  88.0  74.0  Execellent
3   4  63.0  74.0     Average
4   5  63.0  45.0     Average
5   6  53.0  45.0  Execellent
6   7  53.0  45.0     Average
7   8  53.0  45.0     Average
8   9  60.0  62.0        Good
9  10  55.0  65.0        Good

In [21]:
# all the null value will be replaced by the values in backward column
new_df=df.fillna(method="bfill",axis="columns")
new_df

   Id          CS        Math        Name
0   1          50          46     Average
1   2          70          70        Good
2   3          88  Execellent  Execellent
3   4          74          74         NaN
4   5          63     Average     Average
5   6  Execellent  Execellent  Execellent
6   7         NaN         NaN         NaN
7   8          53          45     Average
8   9          60          62        Good
9  10          55          65        Good

In [23]:
df

   Id    CS  Math        Name
0   1  50.0  46.0     Average
1   2   NaN  70.0        Good
2   3  88.0   NaN  Execellent
3   4   NaN  74.0         NaN
4   5  63.0   NaN     Average
5   6   NaN   NaN  Execellent
6   7   NaN   NaN         NaN
7   8  53.0  45.0     Average
8   9  60.0  62.0        Good
9  10  55.0  65.0        Good

In [22]:
#limit : it will fill only one 1 null value
new_df=df.fillna(method="ffill",limit=1)
new_df

   Id    CS  Math        Name
0   1  50.0  46.0     Average
1   2  50.0  70.0        Good
2   3  88.0  70.0  Execellent
3   4  88.0  74.0  Execellent
4   5  63.0  74.0     Average
5   6  63.0   NaN  Execellent
6   7   NaN   NaN  Execellent
7   8  53.0  45.0     Average
8   9  60.0  62.0        Good
9  10  55.0  65.0        Good

In [29]:
new_df=df.fillna(method="ffill",limit=2)
new_df

   Id    CS  Math        Name
0   1  50.0  46.0     Average
1   2  50.0  70.0        Good
2   3  88.0  70.0  Execellent
3   4  88.0  74.0  Execellent
4   5  63.0  74.0     Average
5   6  63.0  74.0  Execellent
6   7  63.0  74.0  Execellent
7   8  53.0  45.0     Average
8   9  60.0  62.0        Good
9  10  55.0  65.0        Good

In [41]:
#change original dataset
new_df=df.fillna(method="ffill",limit=2,inplace=True)
df

   Id    CS  Math        Name
0   1  50.0  46.0     Average
1   2  50.0  70.0        Good
2   3  88.0  70.0  Execellent
3   4  88.0  74.0  Execellent
4   5  63.0  74.0     Average
5   6  63.0  74.0  Execellent
6   7  63.0  74.0  Execellent
7   8  53.0  45.0     Average
8   9  60.0  62.0        Good
9  10  55.0  65.0        Good

In [36]:
df=pd.read_csv("/content/student_data.csv")
df

   Id    CS  Math        Name
0   1  50.0  46.0     Average
1   2   NaN  70.0        Good
2   3  88.0   NaN  Execellent
3   4   NaN  74.0         NaN
4   5  63.0   NaN     Average
5   6   NaN   NaN  Execellent
6   7   NaN   NaN         NaN
7   8  53.0  45.0     Average
8   9  60.0  62.0        Good
9  10  55.0  65.0        Good

In [37]:
#it will fill orignal value in the null values
newdf=df.interpolate()
newdf

   Id         CS   Math        Name
0   1  50.000000  46.00     Average
1   2  69.000000  70.00        Good
2   3  88.000000  72.00  Execellent
3   4  75.500000  74.00         NaN
4   5  63.000000  66.75     Average
5   6  59.666667  59.50  Execellent
6   7  56.333333  52.25         NaN
7   8  53.000000  45.00     Average
8   9  60.000000  62.00        Good
9  10  55.000000  65.00        Good

In [39]:
#delete the row with null values
newdf=df.dropna()
newdf

   Id    CS  Math     Name
0   1  50.0  46.0  Average
7   8  53.0  45.0  Average
8   9  60.0  62.0     Good
9  10  55.0  65.0     Good

In [47]:
df=pd.read_csv("/content/student_data.csv")
#if all the column of a row have null value then and then only it will delete that row
newdf=df.dropna(how='all')
newdf

   Id    CS  Math        Name
0   1  50.0  46.0     Average
1   2   NaN  70.0        Good
2   3  88.0   NaN  Execellent
3   4   NaN  74.0         NaN
4   5  63.0   NaN     Average
5   6   NaN   NaN  Execellent
6   7   NaN   NaN         NaN
7   8  53.0  45.0     Average
8   9  60.0  62.0        Good
9  10  55.0  65.0        Good

In [48]:
#thresh means we are providing some threshold that is here we menrtion thresh means 2 so it will delete row with more than 2 null value
df=pd.read_csv("/content/student_data.csv")
newdf=df.dropna(thresh=2)
newdf

   Id    CS  Math        Name
0   1  50.0  46.0     Average
1   2   NaN  70.0        Good
2   3  88.0   NaN  Execellent
3   4   NaN  74.0         NaN
4   5  63.0   NaN     Average
5   6   NaN   NaN  Execellent
7   8  53.0  45.0     Average
8   9  60.0  62.0        Good
9  10  55.0  65.0        Good

In [50]:
#null values will be replcae with 9999
newdf=df.replace(np.NaN,9999)
newdf

   Id      CS    Math        Name
0   1    50.0    46.0     Average
1   2  9999.0    70.0        Good
2   3    88.0  9999.0  Execellent
3   4  9999.0    74.0        9999
4   5    63.0  9999.0     Average
5   6  9999.0  9999.0  Execellent
6   7  9999.0  9999.0        9999
7   8    53.0    45.0     Average
8   9    60.0    62.0        Good
9  10    55.0    65.0        Good

In [54]:
df

   Id    CS  Math        Name
0   1  50.0  46.0     Average
1   2   NaN  70.0        Good
2   3  88.0   NaN  Execellent
3   4   NaN  74.0         NaN
4   5  63.0   NaN     Average
5   6   NaN   NaN  Execellent
6   7   NaN   NaN         NaN
7   8  53.0  45.0     Average
8   9  60.0  62.0        Good
9  10  55.0  65.0        Good

In [53]:
newdf=df.replace(np.NaN,{
    'CS':999,
    'Math':0,
    'Name':'No Category'
})
newdf

   Id     CS  Math         Name
0   1   50.0  46.0      Average
1   2  999.0  70.0         Good
2   3   88.0   0.0   Execellent
3   4  999.0  74.0  No Category
4   5   63.0   0.0      Average
5   6  999.0   0.0   Execellent
6   7  999.0   0.0  No Category
7   8   53.0  45.0      Average
8   9   60.0  62.0         Good
9  10   55.0  65.0         Good

#Multi linear regression
*
*